riscv-collab/riscv-gnu-toolchain/binutils/sim/msp430/msp430-sim.c
/* Simulator for TI MSP430 and MSP430X

   Copyright (C) 2013-2024 Free Software Foundation, Inc.
   Contributed by Red Hat.
   Based on sim/bfin/bfin-sim.c which was contributed by Analog Devices, Inc.

   This file is part of simulators.

   This program is free software; you can redistribute it and/or modify
   it under the terms of the GNU General Public License as published by
   the Free Software Foundation; either version 3 of the License, or
   (at your option) any later version.

   This program is distributed in the hope that it will be useful,
   but WITHOUT ANY WARRANTY; without even the implied warranty of
   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
   GNU General Public License for more details.

   You should have received a copy of the GNU General Public License
   along with this program.  If not, see <http://www.gnu.org/licenses/>.  */

/* This must come before any other includes.  */
#include "defs.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <inttypes.h>
#include <unistd.h>
#include <assert.h>
#include "opcode/msp430-decode.h"
#include "sim-main.h"
#include "sim-options.h"
#include "sim-signal.h"
#include "sim-syscall.h"
#include "msp430-sim.h"

static sim_cia
msp430_pc_fetch (SIM_CPU *cpu)
{
  struct msp430_cpu_state *msp430_cpu = MSP430_SIM_CPU (cpu);

  return msp430_cpu->regs[0];
}

static void
msp430_pc_store (SIM_CPU *cpu, sim_cia newpc)
{
  struct msp430_cpu_state *msp430_cpu = MSP430_SIM_CPU (cpu);

  msp430_cpu->regs[0] = newpc;
}

static int
msp430_reg_fetch (SIM_CPU *cpu, int regno, void *buf, int len)
{
  struct msp430_cpu_state *msp430_cpu = MSP430_SIM_CPU (cpu);
  unsigned char *memory = buf;

  if (0 <= regno && regno < 16)
    {
      if (len == 2)
	{
	  int val = msp430_cpu->regs[regno];
	  memory[0] = val & 0xff;
	  memory[1] = (val >> 8) & 0xff;
	  return 0;
	}
      else if (len == 4)
	{
	  int val = msp430_cpu->regs[regno];
	  memory[0] = val & 0xff;
	  memory[1] = (val >> 8) & 0xff;
	  memory[2] = (val >> 16) & 0x0f; /* Registers are only 20 bits wide.  */
	  memory[3] = 0;
	  return 0;
	}
      else
	return -1;
    }
  else
    return -1;
}

static int
msp430_reg_store (SIM_CPU *cpu, int regno, const void *buf, int len)
{
  struct msp430_cpu_state *msp430_cpu = MSP430_SIM_CPU (cpu);
  const unsigned char *memory = buf;

  if (0 <= regno && regno < 16)
    {
      if (len == 2)
	{
	  msp430_cpu->regs[regno] = (memory[1] << 8) | memory[0];
	  return len;
	}

      if (len == 4)
	{
	  msp430_cpu->regs[regno] = ((memory[2] << 16) & 0xf0000)
				     | (memory[1] << 8) | memory[0];
	  return len;
	}
    }

  return -1;
}

SIM_DESC
sim_open (SIM_OPEN_KIND kind,
	  struct host_callback_struct *callback,
	  struct bfd *abfd,
	  char * const *argv)
{
  SIM_DESC sd = sim_state_alloc (kind, callback);
  struct msp430_cpu_state *msp430_cpu;
  char c;
  int i;

  /* Initialise the simulator.  */

  /* Set default options before parsing user options.  */
  current_target_byte_order = BFD_ENDIAN_LITTLE;

  if (sim_cpu_alloc_all_extra (sd, 0, sizeof (struct msp430_cpu_state))
      != SIM_RC_OK)
    {
      sim_state_free (sd);
      return 0;
    }

  if (sim_pre_argv_init (sd, argv[0]) != SIM_RC_OK)
    {
      sim_state_free (sd);
      return 0;
    }

  if (sim_parse_args (sd, argv) != SIM_RC_OK)
    {
      sim_state_free (sd);
      return 0;
    }

  /* Allocate memory if none specified by user.
     Note - these values match the memory regions in the libgloss/msp430/msp430[xl]-sim.ld scripts.  */
  if (sim_core_read_buffer (sd, STATE_CPU (sd, 0), read_map, &c, 0x2, 1) == 0)
    sim_do_commandf (sd, "memory-region 0,0x20"); /* Needed by the GDB testsuite.  */
  if (sim_core_read_buffer (sd, STATE_CPU (sd, 0), read_map, &c, 0x500, 1) == 0)
    sim_do_commandf (sd, "memory-region 0x500,0xfac0");  /* RAM and/or ROM */
  if (sim_core_read_buffer (sd, STATE_CPU (sd, 0), read_map, &c, 0xfffe, 1) == 0)
    sim_do_commandf (sd, "memory-region 0xffc0,0x40"); /* VECTORS.  */
  if (sim_core_read_buffer (sd, STATE_CPU (sd, 0), read_map, &c, 0x10000, 1) == 0)
    sim_do_commandf (sd, "memory-region 0x10000,0x80000"); /* HIGH FLASH RAM.  */
  if (sim_core_read_buffer (sd, STATE_CPU (sd, 0), read_map, &c, 0x90000, 1) == 0)
    sim_do_commandf (sd, "memory-region 0x90000,0x70000"); /* HIGH ROM.  */

  /* Check for/establish the a reference program image.  */
  if (sim_analyze_program (sd, STATE_PROG_FILE (sd), abfd) != SIM_RC_OK)
    {
      sim_state_free (sd);
      return 0;
    }

  /* Establish any remaining configuration options.  */
  if (sim_config (sd) != SIM_RC_OK)
    {
      sim_state_free (sd);
      return 0;
    }

  if (sim_post_argv_init (sd) != SIM_RC_OK)
    {
      sim_state_free (sd);
      return 0;
    }

  /* CPU specific initialization.  */
  for (i = 0; i < MAX_NR_PROCESSORS; ++i)
    {
      SIM_CPU *cpu = STATE_CPU (sd, i);

      CPU_PC_FETCH (cpu) = msp430_pc_fetch;
      CPU_PC_STORE (cpu) = msp430_pc_store;
      CPU_REG_FETCH (cpu) = msp430_reg_fetch;
      CPU_REG_STORE (cpu) = msp430_reg_store;

      msp430_cpu = MSP430_SIM_CPU (cpu);
      msp430_cpu->cio_breakpoint = trace_sym_value (sd, "C$$IO$$");
      msp430_cpu->cio_buffer = trace_sym_value (sd, "__CIOBUF__");
      if (msp430_cpu->cio_buffer == -1)
	msp430_cpu->cio_buffer = trace_sym_value (sd, "_CIOBUF_");
    }

  return sd;
}

SIM_RC
sim_create_inferior (SIM_DESC sd,
		     struct bfd *abfd,
		     char * const *argv,
		     char * const *env)
{
  unsigned char resetv[2];
  int new_pc;

  /* Set the PC to the default reset vector if available.  */
  sim_core_read_buffer (sd, STATE_CPU (sd, 0), read_map, resetv, 0xfffe, 2);
  new_pc = resetv[0] + 256 * resetv[1];

  /* If the reset vector isn't initialized, then use the ELF entry.  */
  if (abfd != NULL && !new_pc)
    new_pc = bfd_get_start_address (abfd);

  sim_pc_set (STATE_CPU (sd, 0), new_pc);
  msp430_pc_store (STATE_CPU (sd, 0), new_pc);

  return SIM_RC_OK;
}

typedef struct
{
  SIM_DESC sd;
  int gb_addr;
} Get_Byte_Local_Data;

static int
msp430_getbyte (void *vld)
{
  Get_Byte_Local_Data *ld = (Get_Byte_Local_Data *)vld;
  char buf[1];
  SIM_DESC sd = ld->sd;

